{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"keras_tensor_74": {"name": "keras_tensor_74:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "100"}, {"size": "1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_2_1/lstm_11_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_11_1/strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_11_1/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_11_1/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "150"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_11_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_11_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_11_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "150"}, {"size": "600"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "150"}, {"size": "600"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "600"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_11_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_11_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_11_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_11_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_11_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_10_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_10_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_11_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_11_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_11_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_11_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_11_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_10_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_10_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_10_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "150"}, {"size": "600"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "150"}, {"size": "600"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "600"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_10_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_10_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_10_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_10_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_10_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_9_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_9_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_9_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "150"}, {"size": "600"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "150"}, {"size": "600"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "600"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_9_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_9_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_9_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_9_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_9_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "600"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "150"}, {"size": "600"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "600"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_9_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_9_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_9_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_9_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_9_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_9_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_9_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_10_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_10_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_10_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_10_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_10_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "keras_tensor_74", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "100"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_11_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_11_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_2_1/lstm_11_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_10_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_10_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_2_1/lstm_10_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_9_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_9_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_2_1/lstm_9_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/transpose", "op": "Transpose", "input": ["keras_tensor_74", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/Shape", "op": "Shape", "input": ["keras_tensor_74"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/transpose", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/Shape", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/strided_slice/stack", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/strided_slice/stack_1", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/strided_slice", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/strided_slice", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/zeros/packed", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/zeros/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/zeros_1/packed", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/zeros_1/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/LoopControlInputs/_29", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_2_1/lstm_8_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/TensorArrayV2_1", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/zeros", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/zeros_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/enter/_22", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/TensorArrayV2_1", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/LoopControlInputs/_29"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yXzEvbHN0bV84XzEvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/enter/_25", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/LoopControlInputs/_29"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yXzEvbHN0bV84XzEvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/enter/_20", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/Max", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/LoopControlInputs/_29"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yXzEvbHN0bV84XzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/enter/_19", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/loop_counter", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/LoopControlInputs/_29"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yXzEvbHN0bV84XzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/enter/_23", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/zeros", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/LoopControlInputs/_29"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yXzEvbHN0bV84XzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/enter/_24", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/zeros_1", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/LoopControlInputs/_29"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yXzEvbHN0bV84XzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/enter/_21", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/time", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/LoopControlInputs/_29"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yXzEvbHN0bV84XzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/enter/_26", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_1", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/LoopControlInputs/_29"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yXzEvbHN0bV84XzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/enter/_27", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_2", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/LoopControlInputs/_29"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yXzEvbHN0bV84XzEvd2hpbGU="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/enter/_28", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_3", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/LoopControlInputs/_29"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yXzEvbHN0bV84XzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/merge/_33", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/enter/_22", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/next_iteration/_57"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/merge/_36", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/enter/_25", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/next_iteration/_60"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/merge/_31", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/enter/_20", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/next_iteration/_55"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/merge/_30", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/enter/_19", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/next_iteration/_54"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/merge/_34", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/enter/_23", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/next_iteration/_58"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/merge/_35", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/enter/_24", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/next_iteration/_59"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/merge/_32", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/enter/_21", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/next_iteration/_56"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/cond/_17/input_control_node/_193", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/enter/_26", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/enter/_27", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/enter/_28", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/merge/_30", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/merge/_31", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/merge/_32", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/merge/_33", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/merge/_34", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/merge/_35", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/merge/_36"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/cond/_17/sequential_2_1/lstm_8_1/while/Less_1", "op": "Less", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/merge/_30", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/merge/_31", "^Func/StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/cond/_17/input_control_node/_193"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/cond/_17/sequential_2_1/lstm_8_1/while/Less/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/cond/_17/input_control_node/_193"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/cond/_17/sequential_2_1/lstm_8_1/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/merge/_32", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/cond/_17/sequential_2_1/lstm_8_1/while/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/cond/_17/sequential_2_1/lstm_8_1/while/LogicalAnd", "op": "LogicalAnd", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/cond/_17/sequential_2_1/lstm_8_1/while/Less_1", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/cond/_17/sequential_2_1/lstm_8_1/while/Less"]}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/LoopCond/_37", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/cond/_17/sequential_2_1/lstm_8_1/while/LogicalAnd"]}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/StatefulPartitionedCall/sequential_2_1/lstm_8_1/Max_switch/_39", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/merge/_31", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/LoopCond/_37"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/loop_counter_switch/_38", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/merge/_30", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/LoopCond/_37"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/StatefulPartitionedCall/sequential_2_1/lstm_8_1/zeros_1_switch/_43", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/merge/_35", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/LoopCond/_37"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/StatefulPartitionedCall/sequential_2_1/lstm_8_1/TensorArrayUnstack/TensorListFromTensor_switch/_44", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/merge/_36", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/LoopCond/_37"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/StatefulPartitionedCall/sequential_2_1/lstm_8_1/time_switch/_40", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/merge/_32", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/LoopCond/_37"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/StatefulPartitionedCall/sequential_2_1/lstm_8_1/zeros_switch/_42", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/merge/_34", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/LoopCond/_37"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/StatefulPartitionedCall/sequential_2_1/lstm_8_1/TensorArrayV2_1_switch/_41", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/merge/_33", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/LoopCond/_37"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/exit/_47", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/StatefulPartitionedCall/sequential_2_1/lstm_8_1/Max_switch/_39"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/exit/_46", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/loop_counter_switch/_38"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/loop_body_control/_45", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/loop_counter_switch/_38:1"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/exit/_51", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/StatefulPartitionedCall/sequential_2_1/lstm_8_1/zeros_1_switch/_43"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/exit/_52", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/StatefulPartitionedCall/sequential_2_1/lstm_8_1/TensorArrayUnstack/TensorListFromTensor_switch/_44"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/exit/_48", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/StatefulPartitionedCall/sequential_2_1/lstm_8_1/time_switch/_40"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/exit/_50", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/StatefulPartitionedCall/sequential_2_1/lstm_8_1/zeros_switch/_42"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/exit/_49", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/StatefulPartitionedCall/sequential_2_1/lstm_8_1/TensorArrayV2_1_switch/_41"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "Func/StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/input_control_node/_205", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/StatefulPartitionedCall/sequential_2_1/lstm_8_1/Max_switch/_39", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/StatefulPartitionedCall/sequential_2_1/lstm_8_1/TensorArrayUnstack/TensorListFromTensor_switch/_44", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/StatefulPartitionedCall/sequential_2_1/lstm_8_1/TensorArrayV2_1_switch/_41", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/StatefulPartitionedCall/sequential_2_1/lstm_8_1/time_switch/_40", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/loop_body_control/_45", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/StatefulPartitionedCall/sequential_2_1/lstm_8_1/zeros_1_switch/_43", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/StatefulPartitionedCall/sequential_2_1/lstm_8_1/zeros_switch/_42", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/enter/_26", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/enter/_27", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/enter/_28"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/exit/_49", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "100"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/add_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/input_control_node/_205"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/lstm_cell_1/split/split_dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/input_control_node/_205"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/add/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/input_control_node/_205"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/input/_208", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/StatefulPartitionedCall/sequential_2_1/lstm_8_1/time_switch/_40:1", "^Func/StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/input_control_node/_205"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/input_control_node/_205"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/lstm_cell_1/Cast/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/enter/_26", "^Func/StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/input_control_node/_205"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "600"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/lstm_cell_1/Cast_1/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/enter/_27", "^Func/StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/input_control_node/_205"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "150"}, {"size": "600"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/lstm_cell_1/add_1/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/enter/_28", "^Func/StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/input_control_node/_205"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "600"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_9_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_2_1/lstm_9_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/loop_counter_switch/_38:1", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/add_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/add", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/input/_208", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/add/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/StatefulPartitionedCall/sequential_2_1/lstm_8_1/TensorArrayUnstack/TensorListFromTensor_switch/_44:1", "Func/StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/input/_208", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/lstm_cell_1/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/StatefulPartitionedCall/sequential_2_1/lstm_8_1/zeros_switch/_42:1", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/lstm_cell_1/Cast_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "grad_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "Func/StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/output_control_node/_226", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/lstm_cell_1/Cast/ReadVariableOp", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/lstm_cell_1/Cast_1/ReadVariableOp", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/lstm_cell_1/add_1/ReadVariableOp"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/lstm_cell_1/Cast/ReadVariableOp", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/lstm_cell_1/Cast_1/ReadVariableOp", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/lstm_cell_1/add_1/ReadVariableOp"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_9_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/transpose_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/lstm_cell_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/lstm_cell_1/add_1/ReadVariableOp", "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/lstm_cell_1/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/next_iteration/_60", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/StatefulPartitionedCall/sequential_2_1/lstm_8_1/TensorArrayUnstack/TensorListFromTensor_switch/_44:1", "^Func/StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/output_control_node/_226", "^Func/StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/input_control_node/_205"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/next_iteration/_55", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/StatefulPartitionedCall/sequential_2_1/lstm_8_1/Max_switch/_39:1", "^Func/StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/output_control_node/_226", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/NoOp", "^Func/StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/input_control_node/_205"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/next_iteration/_54", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/add_1", "^Func/StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/output_control_node/_226", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/next_iteration/_56", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/add", "^Func/StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/output_control_node/_226", "^StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_9_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_9_1/Shape", "StatefulPartitionedCall/sequential_2_1/lstm_9_1/strided_slice/stack", "StatefulPartitionedCall/sequential_2_1/lstm_9_1/strided_slice/stack_1", "StatefulPartitionedCall/sequential_2_1/lstm_9_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/lstm_cell_1/add_1", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_8_1/while/body/_18/sequential_2_1/lstm_8_1/while/TensorArrayV2Read/TensorListGetItem", 